The latest versions of oci terraform provider support Terraform v0.12 command.

Please let us know if this configuration example could be useful for you to create `core_route_table` with variable number of route_rules:

```
variable "tenancy_ocid" {}
variable "user_ocid" {}
variable "fingerprint" {}
variable "private_key_path" {}
variable "compartment_ocid" {}
variable "region" {}

provider "oci" {
  tenancy_ocid     = "${var.tenancy_ocid}"
  user_ocid        = "${var.user_ocid}"
  fingerprint      = "${var.fingerprint}"
  private_key_path = "${var.private_key_path}"
  region           = "${var.region}"
  version          = "3.28.2"
}

resource "oci_core_virtual_network" "TFExampleVCN" {
  cidr_block     = "10.1.0.0/16"
  compartment_id = "${var.compartment_ocid}"
  display_name   = "TFExampleVCN"
  dns_label      = "tfexamplevcn"
}

resource "oci_core_internet_gateway" "ExampleIG" {
  compartment_id = "${var.compartment_ocid}"
  display_name   = "TFExampleIG"
  vcn_id         = "${oci_core_virtual_network.TFExampleVCN.id}"
}

variable "cidrs_example" {
  type    = list(string)
  default = ["10.2.0.0/16", "10.3.0.0/16"]
}

resource oci_core_drg "TFExampleDRG" {
  compartment_id = "${var.compartment_ocid}"
  display_name   = "TFExampleDRG"
}

resource "oci_core_route_table" "ExampleRouteTableWithRules" {
  compartment_id = "${var.compartment_ocid}"
  vcn_id         = "${oci_core_virtual_network.TFExampleVCN.id}"
  display_name   = "TFExampleRouteTable"

  dynamic "route_rules" {
    for_each = var.cidrs_example
    content {
      destination       = route_rules.value
      destination_type  = "CIDR_BLOCK"
      network_entity_id = "${oci_core_drg.TFExampleDRG.id}"
    }
  }
}
```

Terraform output for the route table resource:
```
  + resource "oci_core_route_table" "ExampleRouteTableWithRules" {
      + compartment_id = "xxx"
      + defined_tags   = (known after apply)
      + display_name   = "TFExampleRouteTable"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + time_modified  = (known after apply)
      + vcn_id         = (known after apply)

      + route_rules {
          + cidr_block        = (known after apply)
          + destination       = "10.2.0.0/16"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
      + route_rules {
          + cidr_block        = (known after apply)
          + destination       = "10.3.0.0/16"
          + destination_type  = "CIDR_BLOCK"
          + network_entity_id = (known after apply)
        }
    }
```